JayHeng/RT-MFB/boards/mcu/mfb_fw/imxrt1189/cm33/port_mixspi_info.h
/*
 * Copyright 2018-2020 NXP
 * All rights reserved.
 *
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#ifndef _PORT_MIXSPI_INFO_H_
#define _PORT_MIXSPI_INFO_H_

#include "mfb_config.h"
#include "mfb_define.h"

#include "fsl_clock.h"
#include "fsl_iomuxc.h"
#include "fsl_cache.h"
#include "fsl_rgpio.h"
#include "fsl_flexspi.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

#define MFB_MIXSPI_MODULE MFB_MIXSPI_MODULE_IS_FLEXSPI

#define EXAMPLE_MIXSPI                  FLEXSPI1
#define MIXSPI_LUT_SEQS                 (32)
#define NOR_CMD_LUT_SEQ_IDX_START       (0)
#define EXAMPLE_MIXSPI_AMBA_BASE        FlexSPI1_AMBA_BASE
#define EXAMPLE_MIXSPI_AMBA_SIZE        (128 * 1024 * 1024)
#if MFB_FLASH_HYPER_FLASH_ENABLE
#define FLASH_SIZE                      0x10000 /* 512Mb/KByte */
#define EXAMPLE_FLASH_PAGE_SIZE         256
#define EXAMPLE_FLASH_SECTOR_SIZE       0x40000 /* 256K */
#else
#define FLASH_SIZE                      0x4000 /* 16Mb/KByte */
#define EXAMPLE_FLASH_PAGE_SIZE         256
#define EXAMPLE_FLASH_SECTOR_SIZE       0x1000 /* 4K */
#endif
#define EXAMPLE_MIXSPI_CLOCK            kCLOCK_Flexspi1
#define EXAMPLE_MIXSPI_PORT             kFLEXSPI_PortA1

//#define BOARD_IS_RT1180_EVK_PORTA_QUAD      (1)
//#define BOARD_IS_RT1180_EVK_PORTA_OCTAL     (0)
//#define BOARD_IS_RT1180_EVK_PORTB_QUAD      (0)
//#define BOARD_IS_RT1180_EVK_PORTB_OCTAL     (0)  // To Flash memory daughter card

#define BOARD_IS_RT1180_MEM_DC_MUX1         (1)
#define BOARD_IS_RT1180_MEM_DC_MUX2         (0)
#define BOARD_IS_RT1180_MEM_DC_MUX3         (0)

#define BOARD_IS_RT1180_MEM_DC_MUX_FSPI2_HARD_PULL (1)  // Use pull-up/down to set DC-FLEXSPI2_MUX_SEL

/*
 * If cache is enabled, this example should maintain the cache to make sure
 * CPU core accesses the memory, not cache only.
 */
#define CACHE_MAINTAIN 1

/*${macro:end}*/

/*******************************************************************************
 * Variables
 ******************************************************************************/
/*${variable:start}*/
#if (defined CACHE_MAINTAIN) && (CACHE_MAINTAIN == 1)
typedef struct _flexspi_cache_status
{
    volatile bool codeCacheEnableFlag;
    volatile bool systemCacheEnableFlag;
} flexspi_cache_status_t;
#endif
/*${variable:end}*/

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

static void cpu_show_clock_source(void)
{
#if MFB_DEBUG_LOG_INFO_ENABLE
    uint32_t clkSel = CLOCK_GetRootClockMux(kCLOCK_Root_M33);
    switch (clkSel)
    {
        case kCLOCK_M33_ClockRoot_MuxOscRc24M:
            mfb_printf("MFB: CPU-CM33 Clk Source from 2'b00 - OSC RC24M clock %dHz.\r\n", CLOCK_GetFreq(kCLOCK_Osc24M));
            break;

        case kCLOCK_M33_ClockRoot_MuxOscRc400M:
            mfb_printf("MFB: CPU-CM33 Clk Source from 2'b01 - OSC RC400M clock %dHz.\r\n", CLOCK_GetFreq(kCLOCK_OscRc400M));
            break;

        case kCLOCK_M33_ClockRoot_MuxSysPll3Out:
            mfb_printf("MFB: CPU-CM33 Clk Source from 2'b10 - Sys PLL3 clock %dHz.\r\n", CLOCK_GetFreq(kCLOCK_SysPll3Out));
            break;

        case kCLOCK_M33_ClockRoot_MuxArmPllOut:
            mfb_printf("MFB: CPU-CM33 Clk Source from 2'b11 - ARM PLL clock %dHz.\r\n", CLOCK_GetFreq(kCLOCK_ArmPllOut));
            break;

        default:
            break;
    }

    uint32_t clkDiv = CLOCK_GetRootClockDiv(kCLOCK_Root_M33);
    mfb_printf("MFB: CPU-CM33 Clk Source Divider: %d.\r\n", clkDiv);
    mfb_printf("MFB: CPU-CM33 Clk Frequency: %dHz.\r\n", CLOCK_GetFreq(kCLOCK_CpuClk));
#endif
}

static void mixspi_port_switch(FLEXSPI_Type *base, flexspi_port_t port, flexspi_pad_t pads)
{
    rgpio_pin_config_t do_config = {kRGPIO_DigitalOutput, 0};
    if (base == FLEXSPI1)
    {
#if BOARD_IS_RT1180_MEM_DC_MUX1 | BOARD_IS_RT1180_MEM_DC_MUX2
        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_23_GPIO4_IO23, 0U);
        RGPIO_PinInit(RGPIO4, 23, &do_config);
#endif
#if BOARD_IS_RT1180_EVK_PORTB_QUAD | BOARD_IS_RT1180_EVK_PORTB_OCTAL
        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_04_GPIO4_IO04, 0U);
        RGPIO_PinInit(RGPIO4, 4, &do_config);
#endif
        switch (port)
        {
            case kFLEXSPI_PortA1:
            case kFLEXSPI_PortA2:
                RGPIO_PinWrite(RGPIO4, 23, 0);
                break;
            case kFLEXSPI_PortB1:
            case kFLEXSPI_PortB2:
#if BOARD_IS_RT1180_MEM_DC_MUX1
                RGPIO_PinWrite(RGPIO4, 23, 0);
#elif BOARD_IS_RT1180_MEM_DC_MUX2
                RGPIO_PinWrite(RGPIO4, 23, 1);
#endif
#if BOARD_IS_RT1180_EVK_PORTB_QUAD
                RGPIO_PinWrite(RGPIO4, 4, 0);
#elif BOARD_IS_RT1180_EVK_PORTB_OCTAL
                RGPIO_PinWrite(RGPIO4, 4, 1);
#endif
                break;
            default:
                break;
        }
    }
#if !BOARD_IS_RT1180_MEM_DC_MUX_FSPI2_HARD_PULL
    else if (base == FLEXSPI2)
    {
#if BOARD_IS_RT1180_MEM_DC_MUX1 | BOARD_IS_RT1180_MEM_DC_MUX2 | BOARD_IS_RT1180_MEM_DC_MUX3
        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_22_GPIO4_IO22, 0U);
        RGPIO_PinInit(RGPIO4, 22, &do_config);
#endif
        switch (port)
        {
            case kFLEXSPI_PortA1:
            case kFLEXSPI_PortA2:
#if BOARD_IS_RT1180_MEM_DC_MUX1
                RGPIO_PinWrite(RGPIO4, 22, 0);
#elif BOARD_IS_RT1180_MEM_DC_MUX2
                RGPIO_PinWrite(RGPIO4, 22, 1);
#endif
                break;
            case kFLEXSPI_PortB1:
            case kFLEXSPI_PortB2:
#if BOARD_IS_RT1180_MEM_DC_MUX1
                RGPIO_PinWrite(RGPIO4, 22, 0);
#elif BOARD_IS_RT1180_MEM_DC_MUX2 | BOARD_IS_RT1180_MEM_DC_MUX3
                RGPIO_PinWrite(RGPIO4, 22, 1);
#endif
                break;
            default:
                break;
        }
    }
#endif
    else
    {
    }
}

static void mixspi_pin_init(FLEXSPI_Type *base, flexspi_port_t port, flexspi_pad_t pads)
{
    CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
    CLOCK_EnableClock(kCLOCK_Iomuxc2);          /* Turn on LPCG: LPCG is ON. */
    if (base == FLEXSPI1)
    {
        switch (port)
        {
            case kFLEXSPI_PortA1:
            case kFLEXSPI_PortA2:
                IOMUXC_SetPinMux(IOMUXC_GPIO_B2_07_FLEXSPI1_BUS2BIT_A_DQS,    1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_B2_08_FLEXSPI1_BUS2BIT_A_SCLK,   1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_B2_09_FLEXSPI1_BUS2BIT_A_SS0_B,  1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_B2_10_FLEXSPI1_BUS2BIT_A_DATA00, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_B2_11_FLEXSPI1_BUS2BIT_A_DATA01, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_B2_12_FLEXSPI1_BUS2BIT_A_DATA02, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_B2_13_FLEXSPI1_BUS2BIT_A_DATA03, 1U);

                IOMUXC_SetPinMux(IOMUXC_GPIO_B2_03_FLEXSPI1_BUS2BIT_A_DATA04, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_B2_04_FLEXSPI1_BUS2BIT_A_DATA05, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_B2_05_FLEXSPI1_BUS2BIT_A_DATA06, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_B2_06_FLEXSPI1_BUS2BIT_A_DATA07, 1U);
                mfb_printf("MFB: FLEXSPI1 pins are PortA - GPIO_B2[13:03].\r\n");
                break;
            case kFLEXSPI_PortB1:
            case kFLEXSPI_PortB2:
#if BOARD_IS_RT1180_MEM_DC_MUX1 | BOARD_IS_RT1180_EVK_PORTB_QUAD | BOARD_IS_RT1180_EVK_PORTB_OCTAL
                IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_05_FLEXSPI1_BUS2BIT_B_DQS,    1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_06_FLEXSPI1_BUS2BIT_B_SS0_B,  1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_07_FLEXSPI1_BUS2BIT_B_SCLK,   1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_08_FLEXSPI1_BUS2BIT_B_DATA00, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_09_FLEXSPI1_BUS2BIT_B_DATA01, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_10_FLEXSPI1_BUS2BIT_B_DATA02, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_11_FLEXSPI1_BUS2BIT_B_DATA03, 1U);
                
                //IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_05_FLEXSPI1_BUS2BIT_B_DQS,     0x02U);
                //IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_06_FLEXSPI1_BUS2BIT_B_SS0_B,   0x02U);
                //IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_07_FLEXSPI1_BUS2BIT_B_SCLK,    0x02U);
                //IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_08_FLEXSPI1_BUS2BIT_B_DATA00,  0x02U);
                //IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_09_FLEXSPI1_BUS2BIT_B_DATA01,  0x02U);
                //IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_10_FLEXSPI1_BUS2BIT_B_DATA02,  0x02U);
                //IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_11_FLEXSPI1_BUS2BIT_B_DATA03,  0x02U);
                
                IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_00_FLEXSPI1_BUS2BIT_B_DATA04, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_01_FLEXSPI1_BUS2BIT_B_DATA05, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_02_FLEXSPI1_BUS2BIT_B_DATA06, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_03_FLEXSPI1_BUS2BIT_B_DATA07, 1U);
                mfb_printf("MFB: FLEXSPI1 pins are PortB - GPIO_SD_B2[11:05,03:00].\r\n");
#elif BOARD_IS_RT1180_MEM_DC_MUX2
                IOMUXC_SetPinMux(IOMUXC_GPIO_B1_03_FLEXSPI1_BUS2BIT_B_DQS,    1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_B1_04_FLEXSPI1_BUS2BIT_B_SS0_B,  1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_B1_05_FLEXSPI1_BUS2BIT_B_SCLK,   1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_B1_13_FLEXSPI1_BUS2BIT_B_DATA00, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_B1_12_FLEXSPI1_BUS2BIT_B_DATA01, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_B1_11_FLEXSPI1_BUS2BIT_B_DATA02, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_B1_10_FLEXSPI1_BUS2BIT_B_DATA03, 1U);
                
                IOMUXC_SetPinMux(IOMUXC_GPIO_B1_09_FLEXSPI1_BUS2BIT_B_DATA04, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_B1_08_FLEXSPI1_BUS2BIT_B_DATA05, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_B1_07_FLEXSPI1_BUS2BIT_B_DATA06, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_B1_06_FLEXSPI1_BUS2BIT_B_DATA07, 1U);
                mfb_printf("MFB: FLEXSPI1 pins are PortB - GPIO_B1[13:03].\r\n");
#endif
                break;
            default:
                break;
        }

