JayHeng/RT-MFB/boards/mcu/mfb_fw/imxrt1189/cm33/port_mixspi_info.h
    }
    else if (base == FLEXSPI2)
    {
        switch (port)
        {
            case kFLEXSPI_PortA1:
            case kFLEXSPI_PortA2:
            case kFLEXSPI_PortB1:
            case kFLEXSPI_PortB2:
#if BOARD_IS_RT1180_MEM_DC_MUX1
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_35_FLEXSPI2_BUS2BIT_A_DATA00, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_36_FLEXSPI2_BUS2BIT_A_DATA01, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_37_FLEXSPI2_BUS2BIT_A_DATA02, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_38_FLEXSPI2_BUS2BIT_A_DATA03, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_39_FLEXSPI2_BUS2BIT_A_SS0_B,  1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_40_FLEXSPI2_BUS2BIT_A_DQS,    1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_41_FLEXSPI2_BUS2BIT_A_SCLK,   1U);

                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_28_FLEXSPI2_BUS2BIT_B_SS0_B,  1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_29_FLEXSPI2_BUS2BIT_B_DQS,    1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_30_FLEXSPI2_BUS2BIT_B_DATA03, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_31_FLEXSPI2_BUS2BIT_B_DATA02, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_32_FLEXSPI2_BUS2BIT_B_DATA01, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_33_FLEXSPI2_BUS2BIT_B_DATA00, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_34_FLEXSPI2_BUS2BIT_B_SCLK,   1U);
                mfb_printf("MFB: FLEXSPI2 pins are PortA&B - GPIO_EMC_B1[41:28].\r\n");
#elif BOARD_IS_RT1180_MEM_DC_MUX2
                if ((port == kFLEXSPI_PortA1) || (port == kFLEXSPI_PortA2))
                {
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AON_21_FLEXSPI2_BUS2BIT_A_DQS,       1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AON_21_FLEXSPI2_BUS2BIT_A_DQS,    0x02U);  // default 0x0e
                                                  /* Slew Rate Field: Fast Slew Rate
                                                     Drive Strength Field: high driver
                                                     Pull / Keep Select Field: Pull Disable,
                                                     Pull Up / Down Config. Field: Weak pull down
                                                     Open Drain Field: Disabled */

                    IOMUXC_SetPinMux(IOMUXC_GPIO_AON_22_FLEXSPI2_BUS2BIT_A_SS0_B,     1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AON_23_FLEXSPI2_BUS2BIT_A_SCLK,      1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AON_24_FLEXSPI2_BUS2BIT_A_DATA00,    1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AON_25_FLEXSPI2_BUS2BIT_A_DATA01,    1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AON_26_FLEXSPI2_BUS2BIT_A_DATA02,    1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AON_27_FLEXSPI2_BUS2BIT_A_DATA03,    1U);

                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AON_22_FLEXSPI2_BUS2BIT_A_SS0_B,  0x02U);  // default 0x0e
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AON_23_FLEXSPI2_BUS2BIT_A_SCLK,   0x02U);  // default 0x06
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AON_24_FLEXSPI2_BUS2BIT_A_DATA00, 0x02U);  // default 0x06
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AON_25_FLEXSPI2_BUS2BIT_A_DATA01, 0x02U);  // default 0x06
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AON_26_FLEXSPI2_BUS2BIT_A_DATA02, 0x02U);  // default 0x06
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AON_27_FLEXSPI2_BUS2BIT_A_DATA03, 0x02U);  // default 0x0e
                }


#if BOARD_IS_RT1180_MEM_DC_MUX3
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_22_FLEXSPI2_BUS2BIT_B_DATA03, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_23_FLEXSPI2_BUS2BIT_B_DATA02, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_24_FLEXSPI2_BUS2BIT_B_DATA01, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_25_FLEXSPI2_BUS2BIT_B_DATA00, 1U);
#else
                IOMUXC_SetPinMux(IOMUXC_GPIO_AON_15_FLEXSPI2_BUS2BIT_B_DATA03, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_AON_16_FLEXSPI2_BUS2BIT_B_DATA02, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_AON_17_FLEXSPI2_BUS2BIT_B_DATA01, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_AON_18_FLEXSPI2_BUS2BIT_B_DATA00, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_AON_19_FLEXSPI2_BUS2BIT_B_SCLK,   1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_AON_20_FLEXSPI2_BUS2BIT_B_DQS,    1U);
                if ((port == kFLEXSPI_PortB1) || (port == kFLEXSPI_PortB2))
                {
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AON_21_FLEXSPI2_BUS2BIT_B_SS0_B,  1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AON_21_FLEXSPI2_BUS2BIT_B_SS0_B,  0x02U);  // default 0x0e
                    mfb_printf("MFB: FLEXSPI2 pins are PortB - GPIO_AON[21:15].\r\n");
                }
                else
                {
                    mfb_printf("MFB: FLEXSPI2 pins are PortA&B - GPIO_AON[27:15].\r\n");
                }

                IOMUXC_SetPinConfig(IOMUXC_GPIO_AON_20_FLEXSPI2_BUS2BIT_B_DQS,    0x02U);  // default 0x0e
                IOMUXC_SetPinConfig(IOMUXC_GPIO_AON_19_FLEXSPI2_BUS2BIT_B_SCLK,   0x02U);  // default 0x0e
                IOMUXC_SetPinConfig(IOMUXC_GPIO_AON_18_FLEXSPI2_BUS2BIT_B_DATA00, 0x02U);  // default 0x06
                IOMUXC_SetPinConfig(IOMUXC_GPIO_AON_17_FLEXSPI2_BUS2BIT_B_DATA01, 0x02U);  // default 0x06
                IOMUXC_SetPinConfig(IOMUXC_GPIO_AON_16_FLEXSPI2_BUS2BIT_B_DATA02, 0x02U);  // default 0x06
                IOMUXC_SetPinConfig(IOMUXC_GPIO_AON_15_FLEXSPI2_BUS2BIT_B_DATA03, 0x02U);  // default 0x06
                
#endif
#elif BOARD_IS_RT1180_MEM_DC_MUX3
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_28_FLEXSPI2_BUS2BIT_B_SS0_B,  1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_AON_19_FLEXSPI2_BUS2BIT_B_SCLK,   1U);

                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_21_FLEXSPI2_BUS2BIT_B_DQS,    1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_22_FLEXSPI2_BUS2BIT_B_DATA03, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_23_FLEXSPI2_BUS2BIT_B_DATA02, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_24_FLEXSPI2_BUS2BIT_B_DATA01, 1U);
                IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_25_FLEXSPI2_BUS2BIT_B_DATA00, 1U);
                mfb_printf("MFB: FLEXSPI2 pins are PortB - GPIO_EMC_B1[28,25:21],GPIO_AON[19].\r\n");
#endif
                break;
            default:
                break;
        }
    }
    else
    {
    }
}

static void mixspi_clock_init(FLEXSPI_Type *base, mixspi_root_clk_freq_t clkFreq)
{
    clock_root_config_t rootCfg = {0};
    if (base == FLEXSPI1)
    {
        ///////////////////////////////////////////////////////////////////
        // default settings in clock_config.c

        /* Init System Pll2 pfd0. */
        // 528*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
        //CLOCK_InitPfd(kCLOCK_PllSys2, kCLOCK_Pfd0, 29);  -- 327MHz

        /* Init System Pll3 pfd0. */
        // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
        //CLOCK_InitPfd(kCLOCK_PllSys3, kCLOCK_Pfd0, 22);  -- 392MHz
        ///////////////////////////////////////////////////////////////////

        // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 12-35.
        if (clkFreq == kMixspiRootClkFreq_30MHz)
        {
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxOscRc24M;
            rootCfg.div = 1;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else if (clkFreq == kMixspiRootClkFreq_50MHz)
        {
            // System Pll3 pfd0 (392MHz) / 8
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll3Pfd0;
            rootCfg.div = 8;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else if (clkFreq == kMixspiRootClkFreq_60MHz)
        {
            // System Pll3 pfd0 (392MHz) / 7
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll3Pfd0;
            rootCfg.div = 7;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else if (clkFreq == kMixspiRootClkFreq_80MHz)
        {
            // System Pll3 pfd0 (392MHz) / 5
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll3Pfd0;
            rootCfg.div = 5;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else if (clkFreq == kMixspiRootClkFreq_100MHz)
        {
            // System Pll3 pfd0 (392MHz) / 4
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll3Pfd0;
            rootCfg.div = 4;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else if (clkFreq == kMixspiRootClkFreq_120MHz)
        {
            // System Pll2 pfd0 (327MHz) / 3
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll2Pfd0;
            rootCfg.div = 3;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else if (clkFreq == kMixspiRootClkFreq_133MHz)
        {
            // System Pll3 pfd0 (392MHz) / 3
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll3Pfd0;
            rootCfg.div = 3;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else if (clkFreq == kMixspiRootClkFreq_166MHz)
        {
            // System Pll2 pfd0 (327MHz) / 2
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll2Pfd0;
            rootCfg.div = 2;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else if (clkFreq == kMixspiRootClkFreq_200MHz)
        {
            // System Pll3 pfd0 (392MHz) / 2
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll3Pfd0;
            rootCfg.div = 2;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else if (clkFreq == kMixspiRootClkFreq_332MHz)
        {
            // System Pll2 pfd0 (327MHz) / 1
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll2Pfd0;
            rootCfg.div = 1;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else if (clkFreq == kMixspiRootClkFreq_400MHz)
        {
            // System Pll3 pfd0 (392MHz) / 1
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll3Pfd0;
            rootCfg.div = 1;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else
        {
            mfb_printf("MFB: This FlexSPI clock freq is not set.\r\n");
        }
        uint32_t flexspiClk = CLOCK_GetRootClockFreq(kCLOCK_Root_Flexspi1);
        if (flexspiClk > 166000000U)
        {
            __NOP();
        }
    }
    else if (base == FLEXSPI2)
    {
        ///////////////////////////////////////////////////////////////////
        // default settings in clock_config.c

        /* Init System Pll2 pfd1. */
        // 528*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
        //CLOCK_InitPfd(kCLOCK_PllSys2, kCLOCK_Pfd1, 29);  -- 327MHz

        /* Init System Pll3 pfd2. */
        // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
        //CLOCK_InitPfd(kCLOCK_PllSys3, kCLOCK_Pfd2, 22);  -- 392MHz
        ///////////////////////////////////////////////////////////////////

        // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 12-35.
        if (clkFreq == kMixspiRootClkFreq_30MHz)
        {
            rootCfg.mux = kCLOCK_FLEXSPI2_ClockRoot_MuxOscRc24M;
            rootCfg.div = 1;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi2, &rootCfg);
        }
        else if (clkFreq == kMixspiRootClkFreq_50MHz)
        {
            // System Pll3 pfd2 (392MHz) / 8
            rootCfg.mux = kCLOCK_FLEXSPI2_ClockRoot_MuxSysPll3Pfd2;
            rootCfg.div = 8;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi2, &rootCfg);
        }
        else if (clkFreq == kMixspiRootClkFreq_60MHz)
        {
            // System Pll3 pfd2 (392MHz) / 7
            rootCfg.mux = kCLOCK_FLEXSPI2_ClockRoot_MuxSysPll3Pfd2;
            rootCfg.div = 7;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi2, &rootCfg);
        }
        else if (clkFreq == kMixspiRootClkFreq_80MHz)
        {
            // System Pll3 pfd2 (392MHz) / 5
            rootCfg.mux = kCLOCK_FLEXSPI2_ClockRoot_MuxSysPll3Pfd2;
            rootCfg.div = 5;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi2, &rootCfg);
        }
        else if (clkFreq == kMixspiRootClkFreq_100MHz)
        {
            // System Pll3 pfd2 (392MHz) / 4
            rootCfg.mux = kCLOCK_FLEXSPI2_ClockRoot_MuxSysPll3Pfd2;
            rootCfg.div = 4;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi2, &rootCfg);
        }
        else if (clkFreq == kMixspiRootClkFreq_120MHz)
        {
            // System Pll2 pfd1 (327MHz) / 3
            rootCfg.mux = kCLOCK_FLEXSPI2_ClockRoot_MuxSysPll2Pfd1;
            rootCfg.div = 3;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi2, &rootCfg);
        }
        else if (clkFreq == kMixspiRootClkFreq_133MHz)
        {
            // System Pll3 pfd2 (392MHz) / 3
            rootCfg.mux = kCLOCK_FLEXSPI2_ClockRoot_MuxSysPll3Pfd2;
            rootCfg.div = 3;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi2, &rootCfg);
        }
        else if (clkFreq == kMixspiRootClkFreq_166MHz)
        {
            // System Pll2 pfd1 (327MHz) / 2
            rootCfg.mux = kCLOCK_FLEXSPI2_ClockRoot_MuxSysPll2Pfd1;
            rootCfg.div = 2;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi2, &rootCfg);
        }
        else if (clkFreq == kMixspiRootClkFreq_200MHz)
        {
            // System Pll3 pfd2 (392MHz) / 2
            rootCfg.mux = kCLOCK_FLEXSPI2_ClockRoot_MuxSysPll3Pfd2;
            rootCfg.div = 2;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi2, &rootCfg);
        }
        else if (clkFreq == kMixspiRootClkFreq_332MHz)
        {
            // System Pll2 pfd1 (327MHz) / 1
            rootCfg.mux = kCLOCK_FLEXSPI2_ClockRoot_MuxSysPll2Pfd1;
            rootCfg.div = 1;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi2, &rootCfg);
        }
        else if (clkFreq == kMixspiRootClkFreq_400MHz)
        {
            // System Pll3 pfd2 (392MHz) / 1
            rootCfg.mux = kCLOCK_FLEXSPI2_ClockRoot_MuxSysPll3Pfd2;
            rootCfg.div = 1;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi2, &rootCfg);
        }
        else
        {
            mfb_printf("MFB: This FlexSPI clock freq is not set.\r\n");
        }
        uint32_t flexspiClk = CLOCK_GetRootClockFreq(kCLOCK_Root_Flexspi2);
        if (flexspiClk > 166000000U)
        {
            __NOP();
        }
    }
    else
    {
    }
}

static uint32_t mixspi_get_clock(FLEXSPI_Type *base)
{
    if (base == FLEXSPI1)
    {
        return CLOCK_GetRootClockFreq(kCLOCK_Root_Flexspi1);
    }
    else if (base == FLEXSPI2)
    {
        return CLOCK_GetRootClockFreq(kCLOCK_Root_Flexspi2);
    }
    else
    {
        return 0;
    }
}

static void mixspi_show_clock_source(FLEXSPI_Type *base)
{
#if MFB_DEBUG_LOG_INFO_ENABLE
    uint32_t index = 0;
    clock_root_t root;
    uint32_t clkSel;
    if (base == FLEXSPI1)
    {
        root = kCLOCK_Root_Flexspi1;
        clkSel = CLOCK_GetRootClockMux(root);
        switch (clkSel)
        {
            case kCLOCK_FLEXSPI1_ClockRoot_MuxOscRc24M:
                mfb_printf("MFB: FLEXSPI1 Clk Source from 2'b00 - OSC RC24M clock %dHz.\r\n", CLOCK_GetFreq(kCLOCK_Osc24M));
                break;

            case kCLOCK_FLEXSPI1_ClockRoot_MuxOscRc400M:
                mfb_printf("MFB: FLEXSPI1 Clk Source from 2'b01 - OSC RC400M clock %dHz.\r\n", CLOCK_GetFreq(kCLOCK_OscRc400M));
                break;

